MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
        struct
        {
            __IOM uint8_t RIE   : 1;   /*!< [0..0] Voltage Monitor Interrupt/Reset Enable                             */
            __IOM uint8_t DFDIS : 1;   /*!< [1..1] Voltage Monitor Digital Filter Disable Mode Select                 */
            __IOM uint8_t CMPE  : 1;   /*!< [2..2] Voltage Monitor Circuit Comparison Result Output Enable            */
            uint8_t             : 1;
            __IOM uint8_t FSAMP : 2;   /*!< [5..4] Sampling Clock Select                                              */
            __IOM uint8_t RI    : 1;   /*!< [6..6] Voltage Monitor Circuit Mode Select                                */
            __IOM uint8_t RN    : 1;   /*!< [7..7] Voltage Monitor Reset Negate Select                                */
        } LVD2CR0_b;
    };
    __IM uint8_t  RESERVED110;
    __IM uint16_t RESERVED111;
    __IM uint32_t RESERVED112[3];

    union
    {
        __IOM uint8_t VBATTMNSELR;        /*!< (@ 0x00000A84) Battery Backup Voltage Monitor Function Select
                                           *                  Register                                                   */

        struct
        {
            __IOM uint8_t VBATTMNSEL : 1; /*!< [0..0] VBATT Voltage Monitor Function Select Bit                          */
            uint8_t                  : 7;
        } VBATTMNSELR_b;
    };
    __IM uint8_t  RESERVED113;
    __IM uint16_t RESERVED114;

    union
    {
        __IOM uint8_t VBTBPCR1;         /*!< (@ 0x00000A88) VBATT Battery Power Supply Control Register 1              */

        struct
        {
            __IOM uint8_t BPWSWSTP : 1; /*!< [0..0] Battery Power Supply Switch Stop                                   */
            uint8_t                : 7;
        } VBTBPCR1_b;
    };
    __IM uint8_t  RESERVED115;
    __IM uint16_t RESERVED116;
    __IM uint32_t RESERVED117;

    union
    {
        __IOM uint8_t LPSCR;           /*!< (@ 0x00000A90) Low Power State Control Register                           */

        struct
        {
            __IOM uint8_t LPMD : 4;    /*!< [3..0] Low power mode setting bit                                         */
            uint8_t            : 4;
        } LPSCR_b;
    };
    __IM uint8_t  RESERVED118;
    __IM uint16_t RESERVED119;
    __IM uint32_t RESERVED120;

    union
    {
        __IOM uint8_t SSCR1;           /*!< (@ 0x00000A98) Software Standby Control Register 1                        */

        struct
        {
            __IOM uint8_t SS1FR : 1;   /*!< [0..0] Software Standby 1 Fast Return                                     */
            uint8_t             : 7;
        } SSCR1_b;
    };
    __IM uint8_t  RESERVED121;
    __IM uint16_t RESERVED122;
    __IM uint32_t RESERVED123[5];

    union
    {
        __IOM uint8_t LVOCR;           /*!< (@ 0x00000AB0) Low Power State Control Register                           */

        struct
        {
            __IOM uint8_t LVO0E : 1;   /*!< [0..0] Low Voltage Operation 0 Enable                                     */
            __IOM uint8_t LVO1E : 1;   /*!< [1..1] Low Voltage Operation 1 Enable                                     */
            uint8_t             : 6;
        } LVOCR_b;
    };
    __IM uint8_t  RESERVED124;
    __IM uint16_t RESERVED125;
    __IM uint32_t RESERVED126[7];

    union
    {
        __IOM uint8_t SYRSTMSK0;         /*!< (@ 0x00000AD0) System Reset Mask Control Register0                        */

        struct
        {
            __IOM uint8_t IWDTMASK  : 1; /*!< [0..0] Independent watchdog timer Reset Mask                              */
            __IOM uint8_t WDT0MASK  : 1; /*!< [1..1] CPU0 Watchdog timer Reset Mask                                     */
            __IOM uint8_t SWMASK    : 1; /*!< [2..2] Software Reset Mask                                                */
            uint8_t                 : 1;
            __IOM uint8_t CLUP0MASK : 1; /*!< [4..4] CPU0 Lockup Reset Mask                                             */
            __IOM uint8_t LM0MASK   : 1; /*!< [5..5] Local memory 0 error Reset Mask                                    */
            __IOM uint8_t CMMASK    : 1; /*!< [6..6] Common memory error Reset Mask                                     */
            __IOM uint8_t BUSMASK   : 1; /*!< [7..7] BUS error Reset Mask                                               */
        } SYRSTMSK0_b;
    };
    __IM uint8_t  RESERVED127;
    __IM uint16_t RESERVED128;

    union
    {
        __IOM uint8_t SYRSTMSK1;       /*!< (@ 0x00000AD4) System Reset Mask Control Register1                        */

        struct
        {
            uint8_t               : 5;
            __IOM uint8_t LM1MASK : 1; /*!< [5..5] Local memory 1 error Reset Mask                                    */
            uint8_t               : 1;
            __IOM uint8_t NWMASK  : 1; /*!< [7..7] Network Reset Mask                                                 */
        } SYRSTMSK1_b;
    };
    __IM uint8_t  RESERVED129;
    __IM uint16_t RESERVED130;

    union
    {
        __IOM uint8_t SYRSTMSK2;        /*!< (@ 0x00000AD8) System Reset Mask Control Register2                        */

        struct
        {
            __IOM uint8_t LVD1MASK : 1; /*!< [0..0] Voltage Monitor 1 Reset Mask                                       */
            __IOM uint8_t LVD2MASK : 1; /*!< [1..1] Voltage Monitor 2 Reset Mask                                       */
            __IOM uint8_t LVD3MASK : 1; /*!< [2..2] Voltage Monitor 3 Reset Mask                                       */
            __IOM uint8_t LVD4MASK : 1; /*!< [3..3] Voltage Monitor 4 Reset Mask                                       */
            __IOM uint8_t LVD5MASK : 1; /*!< [4..4] Voltage Monitor 5 Reset Mask                                       */
            uint8_t                : 3;
        } SYRSTMSK2_b;
    };
    __IM uint8_t  RESERVED131;
    __IM uint16_t RESERVED132;
    __IM uint32_t RESERVED133[10];

    union
    {
        __IOM uint8_t PLL1LDOCR;       /*!< (@ 0x00000B04) PLL1-LDO Control Register                                  */

        struct
        {
            __IOM uint8_t LDOSTP : 1;  /*!< [0..0] LDO Stop                                                           */
            __IOM uint8_t SKEEP  : 1;  /*!< [1..1] STBY Keep                                                          */
            uint8_t              : 6;
        } PLL1LDOCR_b;
    };
    __IM uint8_t  RESERVED134;
    __IM uint16_t RESERVED135;

    union
    {
        __IOM uint8_t PLL2LDOCR;       /*!< (@ 0x00000B08) PLL2-LDO Control Register                                  */

        struct
        {
            __IOM uint8_t LDOSTP : 1;  /*!< [0..0] LDO Stop                                                           */
            __IOM uint8_t SKEEP  : 1;  /*!< [1..1] STBY Keep                                                          */
            uint8_t              : 6;
        } PLL2LDOCR_b;
    };
    __IM uint8_t  RESERVED136;
    __IM uint16_t RESERVED137;

    union
    {
        __IOM uint8_t HOCOLDOCR;       /*!< (@ 0x00000B0C) HOCO-LDO Control Register                                  */

        struct
        {
            __IOM uint8_t LDOSTP : 1;  /*!< [0..0] LDO Stop                                                           */
            __IOM uint8_t SKEEP  : 1;  /*!< [1..1] STBY Keep                                                          */
            uint8_t              : 6;
        } HOCOLDOCR_b;
    };
    __IM uint8_t  RESERVED138;
    __IM uint16_t RESERVED139;
    __IM uint32_t RESERVED140[4];

    union
    {
        __IOM uint8_t LVD1FCR;         /*!< (@ 0x00000B20) Voltage Monitor % Function Control Register                */

        struct
        {
            __IOM uint8_t RHSEL : 1;   /*!< [0..0] Rise Hysteresis Select                                             */
            uint8_t             : 7;
        } LVD1FCR_b;
    };
    __IM uint8_t  RESERVED141;
    __IM uint16_t RESERVED142;

    union
    {
        __IOM uint8_t LVD2FCR;         /*!< (@ 0x00000B24) Voltage Monitor % Function Control Register                */

        struct
        {
            __IOM uint8_t RHSEL : 1;   /*!< [0..0] Rise Hysteresis Select                                             */
            uint8_t             : 7;
        } LVD2FCR_b;
    };
    __IM uint8_t  RESERVED143;
    __IM uint16_t RESERVED144;
    __IM uint32_t RESERVED145[54];

    union
    {
        __IOM uint8_t SOSCCR;          /*!< (@ 0x00000C00) Sub-clock oscillator control register                      */

        struct
        {
            __IOM uint8_t SOSTP : 1;   /*!< [0..0] Sub-Clock Oscillator Stop                                          */
            uint8_t             : 7;
        } SOSCCR_b;
    };

    union
    {
        __IOM uint8_t SOMCR;           /*!< (@ 0x00000C01) Sub Clock Oscillator Mode Control Register                 */

        struct
        {
            __IOM uint8_t SODRV : 2;   /*!< [1..0] Sub Clock Oscillator Drive Capability Switching                    */
            uint8_t             : 4;
            __IOM uint8_t SOSEL : 1;   /*!< [6..6] Sub Clock Oscillator Switching                                     */
            uint8_t             : 1;
        } SOMCR_b;
    };
    __IM uint16_t RESERVED146;
    __IM uint32_t RESERVED147[15];

    union
    {
        __IOM uint8_t VBTBER;          /*!< (@ 0x00000C40) VBATT Backup Enable Register                               */

        struct
        {
            uint8_t            : 3;
            __IOM uint8_t VBAE : 1;    /*!< [3..3] VBATT backup register access enable bit                            */
            uint8_t            : 4;
        } VBTBER_b;
    };
    __IM uint8_t  RESERVED148;
    __IM uint16_t RESERVED149;
    __IM uint8_t  RESERVED150;

    union
    {
        __IOM uint8_t VBTBPCR2;        /*!< (@ 0x00000C45) VBATT Battery Power Supply Control Register 2              */

        struct
        {
            __IOM uint8_t VDETLVL : 3; /*!< [2..0] VDETBAT Level Select                                               */
            uint8_t               : 1;
            __IOM uint8_t VDETE   : 1; /*!< [4..4] Voltage drop detection enable                                      */
            uint8_t               : 3;
        } VBTBPCR2_b;
    };

    union
    {
        __IOM uint8_t VBTBPSR;         /*!< (@ 0x00000C46) VBATT Battery Power Supply Status Register                 */

        struct
        {
            __IOM uint8_t VBPORF : 1;  /*!< [0..0] VBATT_POR Flag                                                     */
            uint8_t              : 3;
            __IOM uint8_t VBPORM : 1;  /*!< [4..4] VBATT_POR Monitor                                                  */
            __IOM uint8_t BPWSWM : 1;  /*!< [5..5] Battery Power Supply Switch Status Monitor                         */
            uint8_t              : 2;
        } VBTBPSR_b;
    };
    __IM uint8_t RESERVED151;

    union
    {
        __IOM uint8_t VBTADSR;         /*!< (@ 0x00000C48) VBATT Tamper detection Status Register                     */

        struct
        {
            __IOM uint8_t VBTADF0 : 1; /*!< [0..0] VBATT Tamper Detection flag 0                                      */
            __IOM uint8_t VBTADF1 : 1; /*!< [1..1] VBATT Tamper Detection flag 1                                      */
            __IOM uint8_t VBTADF2 : 1; /*!< [2..2] VBATT Tamper Detection flag 2                                      */
            uint8_t               : 5;
        } VBTADSR_b;
    };

    union
    {
        __IOM uint8_t VBTADCR1;          /*!< (@ 0x00000C49) VBATT Tamper detection Control Register 1                  */

        struct
        {
            __IOM uint8_t VBTADIE0  : 1; /*!< [0..0] VBATT Tamper Detection Interrupt Enable 0                          */
            __IOM uint8_t VBTADIE1  : 1; /*!< [1..1] VBATT Tamper Detection Interrupt Enable 1                          */
            __IOM uint8_t VBTADIE2  : 1; /*!< [2..2] VBATT Tamper Detection Interrupt Enable 2                          */
            uint8_t                 : 1;
            __IOM uint8_t VBTADCLE0 : 1; /*!< [4..4] VBATT Tamper Detection Backup Register Clear Enable 0              */
            __IOM uint8_t VBTADCLE1 : 1; /*!< [5..5] VBATT Tamper Detection Backup Register Clear Enable 1              */
            __IOM uint8_t VBTADCLE2 : 1; /*!< [6..6] VBATT Tamper Detection Backup Register Clear Enable 2              */
            uint8_t                 : 1;
        } VBTADCR1_b;
    };

    union
    {
        __IOM uint8_t VBTADCR2;         /*!< (@ 0x00000C4A) VBATT Tamper detection Control Register 2                  */

        struct
        {
            __IOM uint8_t VBRTCES0 : 1; /*!< [0..0] VBATT RTC Time Capture Event Source Select 0                       */
            __IOM uint8_t VBRTCES1 : 1; /*!< [1..1] VBATT RTC Time Capture Event Source Select 1                       */
            __IOM uint8_t VBRTCES2 : 1; /*!< [2..2] VBATT RTC Time Capture Event Source Select 2                       */
            uint8_t                : 5;
        } VBTADCR2_b;
    };
    __IM uint8_t RESERVED152;

    union
    {
        __IOM uint8_t VBTICTLR;         /*!< (@ 0x00000C4C) VBATT Input Control Register                               */

        struct
        {
            __IOM uint8_t VCH0INEN : 1; /*!< [0..0] RTCIC0 Input Enable                                                */
            __IOM uint8_t VCH1INEN : 1; /*!< [1..1] RTCIC1 Input Enable                                                */
            __IOM uint8_t VCH2INEN : 1; /*!< [2..2] RTCIC2 Input Enable                                                */
            uint8_t                : 5;
        } VBTICTLR_b;
    };

    union
    {
        __IOM uint8_t VBTICTLR2;       /*!< (@ 0x00000C4D) VBATT Input Control Register 2                             */

        struct
        {
            __IOM uint8_t VCH0NCE : 1; /*!< [0..0] VBATT CH0 Input Noise Canceler Enable                              */
            __IOM uint8_t VCH1NCE : 1; /*!< [1..1] VBATT CH1 Input Noise Canceler Enable                              */
            __IOM uint8_t VCH2NCE : 1; /*!< [2..2] VBATT CH2 Input Noise Canceler Enable                              */
            uint8_t               : 1;
            __IOM uint8_t VCH0EG  : 1; /*!< [4..4] VBATT CH0 Input Edge Select                                        */
            __IOM uint8_t VCH1EG  : 1; /*!< [5..5] VBATT CH1 Input Edge Select                                        */
            __IOM uint8_t VCH2EG  : 1; /*!< [6..6] VBATT CH2 Input Edge Select                                        */
            uint8_t               : 1;
        } VBTICTLR2_b;
    };

    union
    {
        __IOM uint8_t VBTIMONR;        /*!< (@ 0x00000C4E) VBATT Input Monitor Register                               */

        struct
        {
            __IOM uint8_t VCH0MON : 1; /*!< [0..0] VBATT CH0 Input monitor                                            */
            __IOM uint8_t VCH1MON : 1; /*!< [1..1] VBATT CH1 Input monitor                                            */
            __IOM uint8_t VCH2MON : 1; /*!< [2..2] VBATT CH2 Input monitor                                            */
            uint8_t               : 5;
        } VBTIMONR_b;
    };
    __IM uint8_t  RESERVED153;
    __IM uint32_t RESERVED154[44];

    union
    {
        __IOM uint8_t VBTBKR0;         /*!< (@ 0x00000D00) VBATT Backup Register 0                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR0_b;
    };

    union
    {
        __IOM uint8_t VBTBKR1;         /*!< (@ 0x00000D01) VBATT Backup Register 1                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR1_b;
    };

    union
    {
        __IOM uint8_t VBTBKR2;         /*!< (@ 0x00000D02) VBATT Backup Register 2                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR2_b;
    };

    union
    {
        __IOM uint8_t VBTBKR3;         /*!< (@ 0x00000D03) VBATT Backup Register 3                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR3_b;
    };

    union
    {
        __IOM uint8_t VBTBKR4;         /*!< (@ 0x00000D04) VBATT Backup Register 4                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR4_b;
    };

    union
    {
        __IOM uint8_t VBTBKR5;         /*!< (@ 0x00000D05) VBATT Backup Register 5                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR5_b;
    };

    union
    {
        __IOM uint8_t VBTBKR6;         /*!< (@ 0x00000D06) VBATT Backup Register 6                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR6_b;
    };

    union
    {
        __IOM uint8_t VBTBKR7;         /*!< (@ 0x00000D07) VBATT Backup Register 7                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR7_b;
    };

    union
    {
        __IOM uint8_t VBTBKR8;         /*!< (@ 0x00000D08) VBATT Backup Register 8                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR8_b;
    };

    union
    {
        __IOM uint8_t VBTBKR9;         /*!< (@ 0x00000D09) VBATT Backup Register 9                                    */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR9_b;
    };

    union
    {
        __IOM uint8_t VBTBKR10;        /*!< (@ 0x00000D0A) VBATT Backup Register 10                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR10_b;
    };

    union
    {
        __IOM uint8_t VBTBKR11;        /*!< (@ 0x00000D0B) VBATT Backup Register 11                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR11_b;
    };

    union
    {
        __IOM uint8_t VBTBKR12;        /*!< (@ 0x00000D0C) VBATT Backup Register 12                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR12_b;
    };

    union
    {
        __IOM uint8_t VBTBKR13;        /*!< (@ 0x00000D0D) VBATT Backup Register 13                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR13_b;
    };

    union
    {
        __IOM uint8_t VBTBKR14;        /*!< (@ 0x00000D0E) VBATT Backup Register 14                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR14_b;
    };

    union
    {
        __IOM uint8_t VBTBKR15;        /*!< (@ 0x00000D0F) VBATT Backup Register 15                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR15_b;
    };

    union
    {
        __IOM uint8_t VBTBKR16;        /*!< (@ 0x00000D10) VBATT Backup Register 16                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR16_b;
    };

    union
    {
        __IOM uint8_t VBTBKR17;        /*!< (@ 0x00000D11) VBATT Backup Register 17                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR17_b;
    };

    union
    {
        __IOM uint8_t VBTBKR18;        /*!< (@ 0x00000D12) VBATT Backup Register 18                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR18_b;
    };

    union
    {
        __IOM uint8_t VBTBKR19;        /*!< (@ 0x00000D13) VBATT Backup Register 19                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR19_b;
    };

    union
    {
        __IOM uint8_t VBTBKR20;        /*!< (@ 0x00000D14) VBATT Backup Register 20                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR20_b;
    };

    union
    {
        __IOM uint8_t VBTBKR21;        /*!< (@ 0x00000D15) VBATT Backup Register 21                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR21_b;
    };

    union
    {
        __IOM uint8_t VBTBKR22;        /*!< (@ 0x00000D16) VBATT Backup Register 22                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR22_b;
    };

    union
    {
        __IOM uint8_t VBTBKR23;        /*!< (@ 0x00000D17) VBATT Backup Register 23                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR23_b;
    };

    union
    {
        __IOM uint8_t VBTBKR24;        /*!< (@ 0x00000D18) VBATT Backup Register 24                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR24_b;
    };

    union
    {
        __IOM uint8_t VBTBKR25;        /*!< (@ 0x00000D19) VBATT Backup Register 25                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR25_b;
    };

    union
    {
        __IOM uint8_t VBTBKR26;        /*!< (@ 0x00000D1A) VBATT Backup Register 26                                   */

