MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
        struct
        {
            __IOM uint32_t RFREQ : 8;  /*!< [7..0] Reference Clock Frequency Setting                                  */
            uint32_t             : 24;
        } DPHYREFCR_b;
    };

    union
    {
        __IOM uint32_t DPHYPLFCR;      /*!< (@ 0x00000004) D-PHY PLL Frequency Control Register                       */

        struct
        {
            __IOM uint32_t IDIV  : 2;  /*!< [1..0] D-PHY PLL Input Frequency Division Ratio Select                    */
            uint32_t             : 6;
            __IOM uint32_t NFMUL : 2;  /*!< [9..8] D-PHY PLL Frequency Multiplication Factor Select (Fractional
                                        *   Part)                                                                     */
            uint32_t            : 2;
            __IOM uint32_t PMUL : 2;   /*!< [13..12] D-PHY PLL Output Frequency Division Ratio Select                 */
            uint32_t            : 2;
            __IOM uint32_t NMUL : 9;   /*!< [24..16] D-PHY PLL Frequency Multiplication Factor Select (Integer
                                        *   Part)                                                                     */
            uint32_t : 7;
        } DPHYPLFCR_b;
    };

    union
    {
        __IOM uint32_t DPHYPLOCR;      /*!< (@ 0x00000008) D-PHY PLL Operation Control Register                       */

        struct
        {
            __IOM uint32_t PLLSTP : 1; /*!< [0..0] D-PHY PLL Operation Control                                        */
            uint32_t              : 31;
        } DPHYPLOCR_b;
    };

    union
    {
        __IOM uint32_t DPHYESCCR;      /*!< (@ 0x0000000C) D-PHY Escape Mode Clock Control Register                   */

        struct
        {
            __IOM uint32_t ESCDIV : 5; /*!< [4..0] Escape Mode Transfer Clock Division Ratio                          */
            uint32_t              : 27;
        } DPHYESCCR_b;
    };

    union
    {
        __IOM uint32_t DPHYPWRCR;      /*!< (@ 0x00000010) D-PHY Power Supplying Control Register                     */

        struct
        {
            __IOM uint32_t PWRSEN : 1; /*!< [0..0] D-PHY Power Supplying Control                                      */
            uint32_t              : 31;
        } DPHYPWRCR_b;
    };
    __IM uint32_t RESERVED[2];

    union
    {
        __IM uint32_t DPHYSFR;         /*!< (@ 0x0000001C) D-PHY Status Flag Register                                 */

        struct
        {
            __IM uint32_t PWRSF : 1;   /*!< [0..0] D-PHY LDO Power-on Status Flag                                     */
            uint32_t            : 7;
            __IM uint32_t PLLSF : 1;   /*!< [8..8] D-PHY PLL Oscillation Stabilization Flag                           */
            uint32_t            : 23;
        } DPHYSFR_b;
    };

    union
    {
        __IOM uint32_t DPHYOCR;        /*!< (@ 0x00000020) D-PHY Operation Control Register                           */

        struct
        {
            __IOM uint32_t DPHYEN : 1; /*!< [0..0] D-PHY Operation Control                                            */
            uint32_t              : 31;
        } DPHYOCR_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM1;       /*!< (@ 0x00000024) D-PHY Timing Control Register 1                            */

        struct
        {
            __IOM uint32_t TINIT : 19; /*!< [18..0] D-PHY T_INIT Parameter Setting                                    */
            uint32_t             : 13;
        } DPHYTIM1_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM2;         /*!< (@ 0x00000028) D-PHY Timing Control Register 2                            */

        struct
        {
            __IOM uint32_t TCLKPREP : 8; /*!< [7..0] D-PHY T_CLK_PREPARE Parameter Setting                              */
            __IOM uint32_t TCLKSETT : 8; /*!< [15..8] D-PHY T_CLK_SETTLE Parameter Setting                              */
            __IOM uint32_t TCLKMISS : 8; /*!< [23..16] D-PHY T_CLK_MISS Parameter Setting                               */
            uint32_t                : 8;
        } DPHYTIM2_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM3;        /*!< (@ 0x0000002C) D-PHY Timing Control Register 3                            */

        struct
        {
            __IOM uint32_t THSPREP : 8; /*!< [7..0] D-PHY T_THS_PREPARE Parameter Setting                              */
            __IOM uint32_t THSSETT : 8; /*!< [15..8] D-PHY T_THS_SETTLE Parameter Setting                              */
            uint32_t               : 16;
        } DPHYTIM3_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM4;         /*!< (@ 0x00000030) D-PHY Timing Control Register 4                            */

        struct
        {
            __IOM uint32_t TCLKZERO : 8; /*!< [7..0] D-PHY T_CLK_ZERO Parameter Setting                                 */
            __IOM uint32_t TCLKPRE  : 8; /*!< [15..8] D-PHY T_TCLK_PRE Parameter Setting                                */
            __IOM uint32_t TCLKPOST : 8; /*!< [23..16] D-PHY T_TCLK_POST Parameter Setting                              */
            __IOM uint32_t TCLKTRL  : 8; /*!< [31..24] D-PHY T_TCLK_TRAIL Parameter Setting                             */
        } DPHYTIM4_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM5;        /*!< (@ 0x00000034) D-PHY Timing Control Register 5                            */

        struct
        {
            __IOM uint32_t THSZERO : 8; /*!< [7..0] D-PHY T_THS_ZERO Parameter Setting                                 */
            __IOM uint32_t THSTRL  : 8; /*!< [15..8] D-PHY T_THS_TRAIL Parameter Setting                               */
            __IOM uint32_t THSEXIT : 8; /*!< [23..16] D-PHY T_THS_EXIT Parameter Setting                               */
            uint32_t               : 8;
        } DPHYTIM5_b;
    };

    union
    {
        __IOM uint32_t DPHYTIM6;       /*!< (@ 0x00000038) D-PHY Timing Control Register 6                            */

        struct
        {
            __IOM uint32_t TLPX : 8;   /*!< [7..0] D-PHY T_TLPX Parameter Setting                                     */
            uint32_t            : 24;
        } DPHYTIM6_b;
    };
    __IM uint32_t RESERVED1[3];

    union
    {
        __IOM uint32_t DPHYMDC;          /*!< (@ 0x00000048) D-PHY Mode Control Register                                */

        struct
        {
            __IOM uint32_t MASTEREN : 1; /*!< [0..0] D-PHY Master/Slave Select                                          */
            uint32_t                : 31;
        } DPHYMDC_b;
    };
} R_MIPI_PHY_Type;                       /*!< Size = 76 (0x4c)                                                          */

/* =========================================================================================================================== */
/* ================                                           R_CEU                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Capture Engine Unit (R_CEU)
 */

typedef struct                         /*!< (@ 0x40348000) R_CEU Structure                                            */
{
    union
    {
        __IOM uint32_t CAPSR;          /*!< (@ 0x00000000) Capture Start Register                                     */

        struct
        {
            __IOM uint32_t CE    : 1;  /*!< [0..0] Capture enable                                                     */
            uint32_t             : 15;
            __IOM uint32_t CPKIL : 1;  /*!< [16..16] Write 1 to this bit to perform a software reset of
                                        *   capturing.                                                                */
            uint32_t : 15;
        } CAPSR_b;
    };

    union
    {
        __IOM uint32_t CAPCR;          /*!< (@ 0x00000004) Capture Control Register                                   */

        struct
        {
            uint32_t             : 16;
            __IOM uint32_t CTNCP : 1;  /*!< [16..16] When capturing is started with this bit set to 1, capturing
                                        *   continues until the CE bit in CAPSR is cleared to 0 or
                                        *   a software reset is initiated by the CPKIL bit in CAPSR
                                        *   (see ). Continuous capture must be set before capturing
                                        *   is started.                                                               */
            uint32_t            : 3;
            __IOM uint32_t MTCM : 2;   /*!< [21..20] Specify the unit for transferring data to a bus bridge
                                        *   module.                                                                   */
            uint32_t            : 2;
            __IOM uint32_t FDRP : 8;   /*!< [31..24] Set the frame drop interval in continuous-frame capture.         */
        } CAPCR_b;
    };

    union
    {
        __IOM uint32_t CAMCR;          /*!< (@ 0x00000008) Capture interface control register                         */

        struct
        {
            __IOM uint32_t HDPOL : 1;  /*!< [0..0] Sets the polarity for detection of the horizontal sync
                                        *   signal input from an external module.                                     */
            __IOM uint32_t VDPOL : 1;  /*!< [1..1] Sets the polarity for detection of the vertical sync
                                        *   signal input from an external module.                                     */
            uint32_t             : 2;
            __IOM uint32_t JPG   : 2;  /*!< [5..4] These bits select the fetched data type.                           */
            uint32_t             : 2;
            __IOM uint32_t DTARY : 2;  /*!< [9..8] Set the input order of the luminance component and chrominance
                                        *   component.                                                                */
            uint32_t            : 2;
            __IOM uint32_t DTIF : 1;   /*!< [12..12] Sets the digital image input pins from which data is
                                        *   to be captured.                                                           */
            uint32_t              : 3;
            __IOM uint32_t FLDPOL : 1; /*!< [16..16] Sets the polarity of the field identification signal
                                        *   (FLD) from an external module.                                            */
            uint32_t            : 7;
            __IOM uint32_t DSEL : 1;   /*!< [24..24] Sets the edge for fetching the image data (D7 to D0)
                                        *   from an external module.                                                  */
            __IOM uint32_t FLDSEL : 1; /*!< [25..25] Sets the edge for capturing the field identification
                                        *   signal (FLD) from an external module.                                     */
            __IOM uint32_t HDSEL : 1;  /*!< [26..26] Sets the edge for capturing the horizontal sync signal
                                        *   (HD) from an external module.                                             */
            __IOM uint32_t VDSEL : 1;  /*!< [27..27] Sets the edge for capturing the vertical sync signal
                                        *   (VD) from an external module.                                             */
            uint32_t : 4;
        } CAMCR_b;
    };

    union
    {
        __IOM uint32_t CMCYR;          /*!< (@ 0x0000000C) Capture Interface Cycle Register                           */

        struct
        {
            __IOM uint32_t HCYL : 14;  /*!< [13..0] Horizontal Cycle Count of External Module                         */
            uint32_t            : 2;
            __IOM uint32_t VCYL : 14;  /*!< [29..16] Vertical HD Count of External Module                             */
            uint32_t            : 2;
        } CMCYR_b;
    };

    union
    {
        __IOM uint32_t CAMOR;          /*!< (@ 0x00000010) Capture Interface Offset Register                          */

        struct
        {
            __IOM uint32_t HOFST : 13; /*!< [12..0] Specify the capture start location in terms of the number
                                        *   of clock cycles from a horizontal sync signal (1-cycle
                                        *   units).                                                                   */
            uint32_t             : 3;
            __IOM uint32_t VOFST : 12; /*!< [27..16] Specify the capture start location in terms of the
                                        *   HD count from a vertical sync signal (1-HD units).                        */
            uint32_t : 4;
        } CAMOR_b;
    };

    union
    {
        __IOM uint32_t CAPWR;          /*!< (@ 0x00000014) Capture Interface Width Register                           */

        struct
        {
            __IOM uint32_t HWDTH : 13; /*!< [12..0] Specify the horizontal capture period.                            */
            uint32_t             : 3;
            __IOM uint32_t VWDTH : 12; /*!< [27..16] Specify the vertical capture period (4-HD units).                */
            uint32_t             : 4;
        } CAPWR_b;
    };

    union
    {
        __IOM uint32_t CAIFR;          /*!< (@ 0x00000018) Capture Interface Input Format Register                    */

        struct
        {
            __IOM uint32_t FCI : 2;    /*!< [1..0] Set the timing to start capturing.                                 */
            uint32_t           : 2;
            __IOM uint32_t CIM : 1;    /*!< [4..4] Sets the images to be captured.                                    */
            uint32_t           : 3;
            __IOM uint32_t IFS : 1;    /*!< [8..8] Sets the input mode for capturing images.                          */
            uint32_t           : 23;
        } CAIFR_b;
    };
    __IM uint32_t RESERVED[3];

    union
    {
        __IOM uint32_t CRCNTR;         /*!< (@ 0x00000028) CEU Register Control Register                              */

        struct
        {
            __IOM uint32_t RC : 1;     /*!< [0..0] Specifies switching of the register plane used by the
                                        *   CEU in synchronization with VD.                                           */
            __IOM uint32_t RS : 1;     /*!< [1..1] Specifies which register plane is used by the CEU in
                                        *   synchronization with VD.                                                  */
            uint32_t           : 2;
            __IOM uint32_t RVS : 1;    /*!< [4..4] Sets the timing to switch the register plane in both-field
                                        *   capture.                                                                  */
            uint32_t : 27;
        } CRCNTR_b;
    };

    union
    {
        __IOM uint32_t CRCMPR;         /*!< (@ 0x0000002C) CEU Register Forcible Control Register                     */

        struct
        {
            __IOM uint32_t RA : 1;     /*!< [0..0] Indicates the register plane currently specified.                  */
            uint32_t          : 31;
        } CRCMPR_b;
    };

    union
    {
        __IOM uint32_t CFLCR;          /*!< (@ 0x00000030) Capture Filter Control Register                            */

        struct
        {
            __IOM uint32_t HFRAC : 12; /*!< [11..0] Fraction Part of Horizontal Scale-Down Factor                     */
            __IOM uint32_t HMANT : 4;  /*!< [15..12] Mantissa Part of Horizontal Scale-Down Factor                    */
            __IOM uint32_t VFRAC : 12; /*!< [27..16] Fraction Part of Vertical Scale-Down Factor                      */
            __IOM uint32_t VMANT : 4;  /*!< [31..28] Mantissa Part of Vertical Scale-Down Factor                      */
        } CFLCR_b;
    };

    union
    {
        __IOM uint32_t CFSZR;          /*!< (@ 0x00000034) Capture Filter Size Clip Register                          */

        struct
        {
            __IOM uint32_t HFCLP : 12; /*!< [11..0] Specify the horizontal clipping value of the filter
                                        *   output size (4-pixel units).                                              */
            uint32_t             : 4;
            __IOM uint32_t VFCLP : 12; /*!< [27..16] Set the vertical clipping value of the filter output
                                        *   size (4-pixel units).                                                     */
            uint32_t : 4;
        } CFSZR_b;
    };

    union
    {
        __IOM uint32_t CDWDR;          /*!< (@ 0x00000038) Capture Destination Width Register                         */

        struct
        {
            __IOM uint32_t CHDW : 13;  /*!< [12..0] Specify the horizontal image size in the memory area
                                        *   where the captured image is to be stored (4-byte units).                  */
            uint32_t : 19;
        } CDWDR_b;
    };

    union
    {
        __IOM uint32_t CDAYR;          /*!< (@ 0x0000003C) Capture Data Address Y Register                            */

        struct
        {
            __IOM uint32_t CAYR : 32;  /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR_b;
    };

    union
    {
        __IOM uint32_t CDACR;          /*!< (@ 0x00000040) Capture Data Address C Register                            */

        struct
        {
            __IOM uint32_t CACR : 32;  /*!< [31..0] Capture Data Address C                                            */
        } CDACR_b;
    };

    union
    {
        __IOM uint32_t CDBYR;          /*!< (@ 0x00000044) Capture Data Bottom-Field Address Y Register               */

        struct
        {
            __IOM uint32_t CBYR : 32;  /*!< [31..0] Set the address for storing the Y (luminance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBYR_b;
    };

    union
    {
        __IOM uint32_t CDBCR;          /*!< (@ 0x00000048) Capture Data Bottom-Field Address C Register               */

        struct
        {
            __IOM uint32_t CBCR : 32;  /*!< [31..0] Set the address for storing the C (chrominance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBCR_b;
    };

    union
    {
        __IOM uint32_t CBDSR;          /*!< (@ 0x0000004C) Capture Bundle Destination Size Register                   */

        struct
        {
            __IOM uint32_t CBVS : 23;  /*!< [22..0] Select the number of lines or number of bytes for output
                                        *   to the memory in a bundle write.                                          */
            uint32_t : 9;
        } CBDSR_b;
    };
    __IM uint32_t RESERVED1[3];

    union
    {
        __IOM uint32_t CFWCR;          /*!< (@ 0x0000005C) Firewall Operation Control Register                        */

        struct
        {
            __IOM uint32_t FWE : 1;    /*!< [0..0] With the setting of FWE = 1, when an address exceeds
                                        *   the value set with FWV, the address is retained and an
                                        *   interrupt source FWF is set. After this, the address is
                                        *   not incremented and data is overwritten on the upper limit
                                        *   address.                                                                  */
            uint32_t           : 4;
            __IOM uint32_t FWV : 27;   /*!< [31..5] Specify the upper limit of a write address.                       */
        } CFWCR_b;
    };

    union
    {
        __IOM uint32_t CLFCR;          /*!< (@ 0x00000060) Capture Low-Pass Filter Control Register                   */

        struct
        {
            __IOM uint32_t LPF : 1;    /*!< [0..0] Enables or disables operation of the low-pass filter.              */
            uint32_t           : 31;
        } CLFCR_b;
    };

    union
    {
        __IOM uint32_t CDOCR;          /*!< (@ 0x00000064) Capture Data Output Control Register                       */

        struct
        {
            __IOM uint32_t COBS : 1;   /*!< [0..0] Controls swapping in 8-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COWS : 1;   /*!< [1..1] Controls swapping in 16-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COLS : 1;   /*!< [2..2] Controls swapping in 32-bit units for data output from
                                        *   the CEU.                                                                  */
            uint32_t           : 1;
            __IOM uint32_t CDS : 1;    /*!< [4..4] Sets the image format when outputting the image data
                                        *   captured in the YCbCr422 format to the memory.                            */
            uint32_t           : 11;
            __IOM uint32_t CBE : 1;    /*!< [16..16] Controls the number of lines of captured data to be
                                        *   written to the memory.                                                    */
            uint32_t : 15;
        } CDOCR_b;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
        __IOM uint32_t CEIER;           /*!< (@ 0x00000070) Capture Event Interrupt Enable Register                    */

