MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
 #define R_MIPI_DSI_RXSR_EXTEDET_Msk              (0x8000UL)     /*!< EXTEDET (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSR_MLFERR_Pos               (16UL)         /*!< MLFERR (Bit 16)                                       */
 #define R_MIPI_DSI_RXSR_MLFERR_Msk               (0x10000UL)    /*!< MLFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXSR_ECCERRM_Pos              (17UL)         /*!< ECCERRM (Bit 17)                                      */
 #define R_MIPI_DSI_RXSR_ECCERRM_Msk              (0x20000UL)    /*!< ECCERRM (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSR_UNEXERR_Pos              (18UL)         /*!< UNEXERR (Bit 18)                                      */
 #define R_MIPI_DSI_RXSR_UNEXERR_Msk              (0x40000UL)    /*!< UNEXERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSR_WCERR_Pos                (20UL)         /*!< WCERR (Bit 20)                                        */
 #define R_MIPI_DSI_RXSR_WCERR_Msk                (0x100000UL)   /*!< WCERR (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXSR_CRCERR_Pos               (21UL)         /*!< CRCERR (Bit 21)                                       */
 #define R_MIPI_DSI_RXSR_CRCERR_Msk               (0x200000UL)   /*!< CRCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXSR_IBERR_Pos                (22UL)         /*!< IBERR (Bit 22)                                        */
 #define R_MIPI_DSI_RXSR_IBERR_Msk                (0x400000UL)   /*!< IBERR (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXSR_RXOVFERR_Pos             (23UL)         /*!< RXOVFERR (Bit 23)                                     */
 #define R_MIPI_DSI_RXSR_RXOVFERR_Msk             (0x800000UL)   /*!< RXOVFERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXSR_PRTOERR_Pos              (24UL)         /*!< PRTOERR (Bit 24)                                      */
 #define R_MIPI_DSI_RXSR_PRTOERR_Msk              (0x1000000UL)  /*!< PRTOERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSR_NORESERR_Pos             (25UL)         /*!< NORESERR (Bit 25)                                     */
 #define R_MIPI_DSI_RXSR_NORESERR_Msk             (0x2000000UL)  /*!< NORESERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXSR_RSIZEERR_Pos             (26UL)         /*!< RSIZEERR (Bit 26)                                     */
 #define R_MIPI_DSI_RXSR_RSIZEERR_Msk             (0x4000000UL)  /*!< RSIZEERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXSR_ECCERRS_Pos              (28UL)         /*!< ECCERRS (Bit 28)                                      */
 #define R_MIPI_DSI_RXSR_ECCERRS_Msk              (0x10000000UL) /*!< ECCERRS (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSR_RXAKE_Pos                (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_RXSR_RXAKE_Msk                (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =========================================================  RXSCR  ========================================================= */
 #define R_MIPI_DSI_RXSCR_BTAREND_Pos             (0UL)          /*!< BTAREND (Bit 0)                                       */
 #define R_MIPI_DSI_RXSCR_BTAREND_Msk             (0x1UL)        /*!< BTAREND (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSCR_LRXHTO_Pos              (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_MIPI_DSI_RXSCR_LRXHTO_Msk              (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXSCR_TATO_Pos                (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_MIPI_DSI_RXSCR_TATO_Msk                (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_RXSCR_RXRESP_Pos              (8UL)          /*!< RXRESP (Bit 8)                                        */
 #define R_MIPI_DSI_RXSCR_RXRESP_Msk              (0x100UL)      /*!< RXRESP (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXSCR_RXEOTP_Pos              (10UL)         /*!< RXEOTP (Bit 10)                                       */
 #define R_MIPI_DSI_RXSCR_RXEOTP_Msk              (0x400UL)      /*!< RXEOTP (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXSCR_RXTE_Pos                (13UL)         /*!< RXTE (Bit 13)                                         */
 #define R_MIPI_DSI_RXSCR_RXTE_Msk                (0x2000UL)     /*!< RXTE (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_RXSCR_RXACK_Pos               (14UL)         /*!< RXACK (Bit 14)                                        */
 #define R_MIPI_DSI_RXSCR_RXACK_Msk               (0x4000UL)     /*!< RXACK (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXSCR_EXTEDET_Pos             (15UL)         /*!< EXTEDET (Bit 15)                                      */
 #define R_MIPI_DSI_RXSCR_EXTEDET_Msk             (0x8000UL)     /*!< EXTEDET (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSCR_MLFERR_Pos              (16UL)         /*!< MLFERR (Bit 16)                                       */
 #define R_MIPI_DSI_RXSCR_MLFERR_Msk              (0x10000UL)    /*!< MLFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXSCR_ECCERRM_Pos             (17UL)         /*!< ECCERRM (Bit 17)                                      */
 #define R_MIPI_DSI_RXSCR_ECCERRM_Msk             (0x20000UL)    /*!< ECCERRM (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSCR_UNEXERR_Pos             (18UL)         /*!< UNEXERR (Bit 18)                                      */
 #define R_MIPI_DSI_RXSCR_UNEXERR_Msk             (0x40000UL)    /*!< UNEXERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSCR_WCERR_Pos               (20UL)         /*!< WCERR (Bit 20)                                        */
 #define R_MIPI_DSI_RXSCR_WCERR_Msk               (0x100000UL)   /*!< WCERR (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXSCR_CRCERR_Pos              (21UL)         /*!< CRCERR (Bit 21)                                       */
 #define R_MIPI_DSI_RXSCR_CRCERR_Msk              (0x200000UL)   /*!< CRCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXSCR_IBERR_Pos               (22UL)         /*!< IBERR (Bit 22)                                        */
 #define R_MIPI_DSI_RXSCR_IBERR_Msk               (0x400000UL)   /*!< IBERR (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXSCR_RXOVFERR_Pos            (23UL)         /*!< RXOVFERR (Bit 23)                                     */
 #define R_MIPI_DSI_RXSCR_RXOVFERR_Msk            (0x800000UL)   /*!< RXOVFERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXSCR_PRTOERR_Pos             (24UL)         /*!< PRTOERR (Bit 24)                                      */
 #define R_MIPI_DSI_RXSCR_PRTOERR_Msk             (0x1000000UL)  /*!< PRTOERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSCR_NORESERR_Pos            (25UL)         /*!< NORESERR (Bit 25)                                     */
 #define R_MIPI_DSI_RXSCR_NORESERR_Msk            (0x2000000UL)  /*!< NORESERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXSCR_RSIZEERR_Pos            (26UL)         /*!< RSIZEERR (Bit 26)                                     */
 #define R_MIPI_DSI_RXSCR_RSIZEERR_Msk            (0x4000000UL)  /*!< RSIZEERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXSCR_ECCERRS_Pos             (28UL)         /*!< ECCERRS (Bit 28)                                      */
 #define R_MIPI_DSI_RXSCR_ECCERRS_Msk             (0x10000000UL) /*!< ECCERRS (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXSCR_RXAKE_Pos               (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_RXSCR_RXAKE_Msk               (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* =========================================================  RXIER  ========================================================= */
 #define R_MIPI_DSI_RXIER_BTAREND_Pos             (0UL)          /*!< BTAREND (Bit 0)                                       */
 #define R_MIPI_DSI_RXIER_BTAREND_Msk             (0x1UL)        /*!< BTAREND (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXIER_LRXHTO_Pos              (1UL)          /*!< LRXHTO (Bit 1)                                        */
 #define R_MIPI_DSI_RXIER_LRXHTO_Msk              (0x2UL)        /*!< LRXHTO (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXIER_TATO_Pos                (2UL)          /*!< TATO (Bit 2)                                          */
 #define R_MIPI_DSI_RXIER_TATO_Msk                (0x4UL)        /*!< TATO (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_RXIER_RXRESP_Pos              (8UL)          /*!< RXRESP (Bit 8)                                        */
 #define R_MIPI_DSI_RXIER_RXRESP_Msk              (0x100UL)      /*!< RXRESP (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXIER_RXEOTP_Pos              (10UL)         /*!< RXEOTP (Bit 10)                                       */
 #define R_MIPI_DSI_RXIER_RXEOTP_Msk              (0x400UL)      /*!< RXEOTP (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXIER_RXTE_Pos                (13UL)         /*!< RXTE (Bit 13)                                         */
 #define R_MIPI_DSI_RXIER_RXTE_Msk                (0x2000UL)     /*!< RXTE (Bitfield-Mask: 0x01)                            */
 #define R_MIPI_DSI_RXIER_RXACK_Pos               (14UL)         /*!< RXACK (Bit 14)                                        */
 #define R_MIPI_DSI_RXIER_RXACK_Msk               (0x4000UL)     /*!< RXACK (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXIER_EXTEDET_Pos             (15UL)         /*!< EXTEDET (Bit 15)                                      */
 #define R_MIPI_DSI_RXIER_EXTEDET_Msk             (0x8000UL)     /*!< EXTEDET (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXIER_MLFERR_Pos              (16UL)         /*!< MLFERR (Bit 16)                                       */
 #define R_MIPI_DSI_RXIER_MLFERR_Msk              (0x10000UL)    /*!< MLFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXIER_ECCERRM_Pos             (17UL)         /*!< ECCERRM (Bit 17)                                      */
 #define R_MIPI_DSI_RXIER_ECCERRM_Msk             (0x20000UL)    /*!< ECCERRM (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXIER_UNEXERR_Pos             (18UL)         /*!< UNEXERR (Bit 18)                                      */
 #define R_MIPI_DSI_RXIER_UNEXERR_Msk             (0x40000UL)    /*!< UNEXERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXIER_WCERR_Pos               (20UL)         /*!< WCERR (Bit 20)                                        */
 #define R_MIPI_DSI_RXIER_WCERR_Msk               (0x100000UL)   /*!< WCERR (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXIER_CRCERR_Pos              (21UL)         /*!< CRCERR (Bit 21)                                       */
 #define R_MIPI_DSI_RXIER_CRCERR_Msk              (0x200000UL)   /*!< CRCERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXIER_IBERR_Pos               (22UL)         /*!< IBERR (Bit 22)                                        */
 #define R_MIPI_DSI_RXIER_IBERR_Msk               (0x400000UL)   /*!< IBERR (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXIER_RXOVFERR_Pos            (23UL)         /*!< RXOVFERR (Bit 23)                                     */
 #define R_MIPI_DSI_RXIER_RXOVFERR_Msk            (0x800000UL)   /*!< RXOVFERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXIER_PRTOERR_Pos             (24UL)         /*!< PRTOERR (Bit 24)                                      */
 #define R_MIPI_DSI_RXIER_PRTOERR_Msk             (0x1000000UL)  /*!< PRTOERR (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXIER_NORESERR_Pos            (25UL)         /*!< NORESERR (Bit 25)                                     */
 #define R_MIPI_DSI_RXIER_NORESERR_Msk            (0x2000000UL)  /*!< NORESERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXIER_RSIZEERR_Pos            (26UL)         /*!< RSIZEERR (Bit 26)                                     */
 #define R_MIPI_DSI_RXIER_RSIZEERR_Msk            (0x4000000UL)  /*!< RSIZEERR (Bitfield-Mask: 0x01)                        */
 #define R_MIPI_DSI_RXIER_ECCERRS_Pos             (28UL)         /*!< ECCERRS (Bit 28)                                      */
 #define R_MIPI_DSI_RXIER_ECCERRS_Msk             (0x10000000UL) /*!< ECCERRS (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXIER_RXAKE_Pos               (30UL)         /*!< RXAKE (Bit 30)                                        */
 #define R_MIPI_DSI_RXIER_RXAKE_Msk               (0x40000000UL) /*!< RXAKE (Bitfield-Mask: 0x01)                           */
/* ====================================================  PRESPTOBTASETR  ===================================================== */
 #define R_MIPI_DSI_PRESPTOBTASETR_PRTBTA_Pos     (0UL)          /*!< PRTBTA (Bit 0)                                        */
 #define R_MIPI_DSI_PRESPTOBTASETR_PRTBTA_Msk     (0xffffffffUL) /*!< PRTBTA (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  PRESPTOLPSETR  ===================================================== */
 #define R_MIPI_DSI_PRESPTOLPSETR_LPWTO_Pos       (0UL)          /*!< LPWTO (Bit 0)                                         */
 #define R_MIPI_DSI_PRESPTOLPSETR_LPWTO_Msk       (0xffffUL)     /*!< LPWTO (Bitfield-Mask: 0xffff)                         */
 #define R_MIPI_DSI_PRESPTOLPSETR_LPRTO_Pos       (16UL)         /*!< LPRTO (Bit 16)                                        */
 #define R_MIPI_DSI_PRESPTOLPSETR_LPRTO_Msk       (0xffff0000UL) /*!< LPRTO (Bitfield-Mask: 0xffff)                         */
/* =====================================================  PRESPTOHSSETR  ===================================================== */
 #define R_MIPI_DSI_PRESPTOHSSETR_HSWTO_Pos       (0UL)          /*!< HSWTO (Bit 0)                                         */
 #define R_MIPI_DSI_PRESPTOHSSETR_HSWTO_Msk       (0xffffUL)     /*!< HSWTO (Bitfield-Mask: 0xffff)                         */
 #define R_MIPI_DSI_PRESPTOHSSETR_HSRTO_Pos       (16UL)         /*!< HSRTO (Bit 16)                                        */
 #define R_MIPI_DSI_PRESPTOHSSETR_HSRTO_Msk       (0xffff0000UL) /*!< HSRTO (Bitfield-Mask: 0xffff)                         */
/* =======================================================  AKEPLATIR  ======================================================= */
 #define R_MIPI_DSI_AKEPLATIR_EREP_Pos            (0UL)          /*!< EREP (Bit 0)                                          */
 #define R_MIPI_DSI_AKEPLATIR_EREP_Msk            (0xffffUL)     /*!< EREP (Bitfield-Mask: 0xffff)                          */
 #define R_MIPI_DSI_AKEPLATIR_VC_Pos              (16UL)         /*!< VC (Bit 16)                                           */
 #define R_MIPI_DSI_AKEPLATIR_VC_Msk              (0xf0000UL)    /*!< VC (Bitfield-Mask: 0x0f)                              */
/* =======================================================  AKEPACMSR  ======================================================= */
 #define R_MIPI_DSI_AKEPACMSR_AEREP_Pos           (0UL)          /*!< AEREP (Bit 0)                                         */
 #define R_MIPI_DSI_AKEPACMSR_AEREP_Msk           (0xffffUL)     /*!< AEREP (Bitfield-Mask: 0xffff)                         */
 #define R_MIPI_DSI_AKEPACMSR_AVC_Pos             (16UL)         /*!< AVC (Bit 16)                                          */
 #define R_MIPI_DSI_AKEPACMSR_AVC_Msk             (0xf0000UL)    /*!< AVC (Bitfield-Mask: 0x0f)                             */
/* ========================================================  AKEPSCR  ======================================================== */
 #define R_MIPI_DSI_AKEPSCR_AEREP_Pos             (0UL)          /*!< AEREP (Bit 0)                                         */
 #define R_MIPI_DSI_AKEPSCR_AEREP_Msk             (0xffffUL)     /*!< AEREP (Bitfield-Mask: 0xffff)                         */
 #define R_MIPI_DSI_AKEPSCR_AVC_Pos               (16UL)         /*!< AVC (Bit 16)                                          */
 #define R_MIPI_DSI_AKEPSCR_AVC_Msk               (0xf0000UL)    /*!< AVC (Bitfield-Mask: 0x0f)                             */
/* ========================================================  RXRSSR  ========================================================= */
 #define R_MIPI_DSI_RXRSSR_SLT0VLD_Pos            (0UL)          /*!< SLT0VLD (Bit 0)                                       */
 #define R_MIPI_DSI_RXRSSR_SLT0VLD_Msk            (0x1UL)        /*!< SLT0VLD (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSSR_SLT1VLD_Pos            (1UL)          /*!< SLT1VLD (Bit 1)                                       */
 #define R_MIPI_DSI_RXRSSR_SLT1VLD_Msk            (0x2UL)        /*!< SLT1VLD (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSSR_SLT2VLD_Pos            (2UL)          /*!< SLT2VLD (Bit 2)                                       */
 #define R_MIPI_DSI_RXRSSR_SLT2VLD_Msk            (0x4UL)        /*!< SLT2VLD (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSSR_SLT3VLD_Pos            (3UL)          /*!< SLT3VLD (Bit 3)                                       */
 #define R_MIPI_DSI_RXRSSR_SLT3VLD_Msk            (0x8UL)        /*!< SLT3VLD (Bitfield-Mask: 0x01)                         */
/* ========================================================  RXRSSCR  ======================================================== */
 #define R_MIPI_DSI_RXRSSCR_SLT0VLD_Pos           (0UL)          /*!< SLT0VLD (Bit 0)                                       */
 #define R_MIPI_DSI_RXRSSCR_SLT0VLD_Msk           (0x1UL)        /*!< SLT0VLD (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSSCR_SLT1VLD_Pos           (1UL)          /*!< SLT1VLD (Bit 1)                                       */
 #define R_MIPI_DSI_RXRSSCR_SLT1VLD_Msk           (0x2UL)        /*!< SLT1VLD (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSSCR_SLT2VLD_Pos           (2UL)          /*!< SLT2VLD (Bit 2)                                       */
 #define R_MIPI_DSI_RXRSSCR_SLT2VLD_Msk           (0x4UL)        /*!< SLT2VLD (Bitfield-Mask: 0x01)                         */
 #define R_MIPI_DSI_RXRSSCR_SLT3VLD_Pos           (3UL)          /*!< SLT3VLD (Bit 3)                                       */
 #define R_MIPI_DSI_RXRSSCR_SLT3VLD_Msk           (0x8UL)        /*!< SLT3VLD (Bitfield-Mask: 0x01)                         */
/* ======================================================  RXRINFOOWSR  ====================================================== */
 #define R_MIPI_DSI_RXRINFOOWSR_SL0OW_Pos         (0UL)          /*!< SL0OW (Bit 0)                                         */
 #define R_MIPI_DSI_RXRINFOOWSR_SL0OW_Msk         (0x1UL)        /*!< SL0OW (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRINFOOWSR_SL1OW_Pos         (1UL)          /*!< SL1OW (Bit 1)                                         */
 #define R_MIPI_DSI_RXRINFOOWSR_SL1OW_Msk         (0x2UL)        /*!< SL1OW (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRINFOOWSR_SL2OW_Pos         (2UL)          /*!< SL2OW (Bit 2)                                         */
 #define R_MIPI_DSI_RXRINFOOWSR_SL2OW_Msk         (0x4UL)        /*!< SL2OW (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRINFOOWSR_SL3OW_Pos         (3UL)          /*!< SL3OW (Bit 3)                                         */
 #define R_MIPI_DSI_RXRINFOOWSR_SL3OW_Msk         (0x8UL)        /*!< SL3OW (Bitfield-Mask: 0x01)                           */
/* =====================================================  RXRINFOOWSCR  ====================================================== */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL0OW_Pos        (0UL)          /*!< SL0OW (Bit 0)                                         */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL0OW_Msk        (0x1UL)        /*!< SL0OW (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL1OW_Pos        (1UL)          /*!< SL1OW (Bit 1)                                         */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL1OW_Msk        (0x2UL)        /*!< SL1OW (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL2OW_Pos        (2UL)          /*!< SL2OW (Bit 2)                                         */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL2OW_Msk        (0x4UL)        /*!< SL2OW (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL3OW_Pos        (3UL)          /*!< SL3OW (Bit 3)                                         */
 #define R_MIPI_DSI_RXRINFOOWSCR_SL3OW_Msk        (0x8UL)        /*!< SL3OW (Bitfield-Mask: 0x01)                           */
/* ========================================================  RXRSS0R  ======================================================== */
 #define R_MIPI_DSI_RXRSS0R_DATA0_Pos             (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_RXRSS0R_DATA0_Msk             (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS0R_DATA1_Pos             (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_RXRSS0R_DATA1_Msk             (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_RXRSS0R_DT_Pos                (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_RXRSS0R_DT_Msk                (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_RXRSS0R_VC_Pos                (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_RXRSS0R_VC_Msk                (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_RXRSS0R_FMT_Pos               (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_RXRSS0R_FMT_Msk               (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_RXRSS0R_RXSUC_Pos             (25UL)         /*!< RXSUC (Bit 25)                                        */
 #define R_MIPI_DSI_RXRSS0R_RXSUC_Msk             (0x2000000UL)  /*!< RXSUC (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_RXRSS0R_RXFERR_Pos            (26UL)         /*!< RXFERR (Bit 26)                                       */
 #define R_MIPI_DSI_RXRSS0R_RXFERR_Msk            (0x4000000UL)  /*!< RXFERR (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_RXRSS0R_RXFAIL_Pos            (27UL)         /*!< RXFAIL (Bit 27)                                       */
 #define R_MIPI_DSI_RXRSS0R_RXFAIL_Msk            (0x8000000UL)  /*!< RXFAIL (Bitfield-Mask: 0x01)                          */
