MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
 #define R_MIPI_DSI_SQCH0DSC3AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC3AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC3AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC3AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC3AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC3AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC3AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC3AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC4AR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC4AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC4AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC4AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC4AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC4AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC4AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC4AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC4AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC5AR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC5AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC5AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC5AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC5AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC5AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC5AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC5AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC5AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC6AR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC6AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC6AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC6AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC6AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC6AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC6AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC6AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC6AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC7AR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC7AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC7AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC7AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC7AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH0DSC7AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH0DSC7AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH0DSC7AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH0DSC7AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC0AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC0AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC1AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC1AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC2AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC2AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC3AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC3AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC4AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC4AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC5AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC5AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC6AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC6AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC7AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH0DSC7AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC0AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC1AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC2AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC3AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC4AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC5AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC6AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC7AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC0AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC1AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC2AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC3AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC4AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC5AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC6AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC7AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC0AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC0AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC1AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
