MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC7AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC7AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC0BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC0BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC0BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC1BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC1BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC1BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC2BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC2BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC2BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC3BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC3BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC3BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC4BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC4BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC4BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC5BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC5BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC5BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC6BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC6BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC6BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC7BR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC7BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH0DSC7BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH0DSC0CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC0CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC0CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC0CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC0CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC0CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC0CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC1CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC1CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC1CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC1CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC1CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC1CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC1CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC2CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC2CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC2CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC2CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC2CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC2CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC2CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC3CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC3CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC3CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC3CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC3CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC3CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC3CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC4CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC4CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC4CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC4CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC4CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC4CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC4CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC5CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC5CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC5CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC5CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC5CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC5CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC5CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC6CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC6CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC6CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC6CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC6CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC6CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC6CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC7CR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC7CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC7CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH0DSC7CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH0DSC7CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC7CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH0DSC7CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC0CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC0CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC1CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC1CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC2CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC2CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC3CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC3CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC4CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC4CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC5CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC5CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC6CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC6CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC7CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC7CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC0CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC0CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC1CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC1CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC2CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC2CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC3CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC3CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC4CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC4CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC5CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC5CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC6CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC6CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH0DSC7CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH0DSC7CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH0DSC0CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC0CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC0CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC0CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC1CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC1CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC1CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC1CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC2CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC2CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC2CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC2CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC3CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC3CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC3CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC3CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC4CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC4CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC4CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC4CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC5CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC5CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC5CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC5CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC6CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC6CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC6CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC6CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH0DSC7CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC7CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH0DSC7CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH0DSC7CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC0CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC0CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC1CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC1CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC2CR_HL  ===================================================== */
