MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
 #define R_MIPI_DSI_SQCH0DSC2CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC2CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC3CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC3CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC4CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC4CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC5CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC5CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC6CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC6CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC7CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH0DSC7CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH0DSC0CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC0CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC1CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC1CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC2CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC2CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC3CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC3CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC4CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC4CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC5CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC5CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC6CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC6CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH0DSC7CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH0DSC7CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH0DSC0DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC0DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC1DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC1DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC2DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC2DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC3DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC3DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC4DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC4DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC5DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC5DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC6DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC6DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH0DSC7DR  ====================================================== */
 #define R_MIPI_DSI_SQCH0DSC7DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* =====================================================  SQCH0DSC0DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC1DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC2DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC3DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC4DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC5DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC6DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC7DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* ====================================================  SQCH0DSC0DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC1DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC2DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC3DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC4DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC5DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC6DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC7DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC0DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC1DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC2DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC3DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC4DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC5DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC6DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC7DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH0DSC0DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC1DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC2DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC3DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC4DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC5DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC6DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH0DSC7DR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7DR_H_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7DR_H_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* ====================================================  SQCH0DSC0DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC0DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC1DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC2DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC3DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC4DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC5DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC6DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC7DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC0DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
