MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
 #define R_MIPI_DSI_SQCH0DSC0DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC1DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC1DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC2DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC2DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC3DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC3DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC4DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC4DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC5DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC5DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC6DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC6DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH0DSC7DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH0DSC7DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ======================================================  SQCH1DSC0AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC0AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC0AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC0AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC0AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC0AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC0AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC0AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC0AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC1AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC1AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC1AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC1AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC1AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC1AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC1AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC1AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC1AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC2AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC2AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC2AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC2AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC2AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC2AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC2AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC2AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC2AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC3AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC3AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC3AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC3AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC3AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC3AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC3AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC3AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC3AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC4AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC4AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC4AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC4AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC4AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC4AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC4AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC4AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC4AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC5AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC5AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC5AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC5AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC5AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC5AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC5AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC5AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC5AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC6AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC6AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC6AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC6AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC6AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC6AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC6AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC6AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC6AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC7AR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC7AR_DATA0_Pos         (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7AR_DATA0_Msk         (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_DATA1_Pos         (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC7AR_DATA1_Msk         (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_DT_Pos            (16UL)         /*!< DT (Bit 16)                                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_DT_Msk            (0x3f0000UL)   /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC7AR_VC_Pos            (22UL)         /*!< VC (Bit 22)                                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_VC_Msk            (0xc00000UL)   /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC7AR_FMT_Pos           (24UL)         /*!< FMT (Bit 24)                                          */
 #define R_MIPI_DSI_SQCH1DSC7AR_FMT_Msk           (0x1000000UL)  /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_SPD_Pos           (25UL)         /*!< SPD (Bit 25)                                          */
 #define R_MIPI_DSI_SQCH1DSC7AR_SPD_Msk           (0x2000000UL)  /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_BTA_Pos           (26UL)         /*!< BTA (Bit 26)                                          */
 #define R_MIPI_DSI_SQCH1DSC7AR_BTA_Msk           (0xc000000UL)  /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_NXACT_Pos         (28UL)         /*!< NXACT (Bit 28)                                        */
 #define R_MIPI_DSI_SQCH1DSC7AR_NXACT_Msk         (0x30000000UL) /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC0AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC0AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH1DSC1AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC1AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH1DSC2AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC2AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH1DSC3AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC3AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH1DSC4AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC4AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH1DSC5AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC5AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
