MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
 #define R_MIPI_DSI_SQCH1DSC7CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC7CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC0CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC0CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC1CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC1CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC2CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC2CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC3CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC3CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC4CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC4CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC5CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC5CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC6CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC6CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* ====================================================  SQCH1DSC7CR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7CR_LL_FINACT_Pos     (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC7CR_LL_FINACT_Msk     (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC0CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC0CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC0CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC0CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC1CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC1CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC1CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC1CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC2CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC2CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC2CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC2CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC3CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC3CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC3CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC3CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC4CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC4CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC4CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC4CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC5CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC5CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC5CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC5CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC6CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC6CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC6CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC6CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC7CR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7CR_H_AUXOP_Pos       (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC7CR_H_AUXOP_Msk       (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC7CR_H_ACTCODE_Pos     (8UL)          /*!< ACTCODE (Bit 8)                                       */
 #define R_MIPI_DSI_SQCH1DSC7CR_H_ACTCODE_Msk     (0xff00UL)     /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC0CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC0CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC1CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC1CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC2CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC2CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC3CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC3CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC4CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC4CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC5CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC5CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC6CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC6CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC7CR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7CR_HL_AUXOP_Pos      (6UL)          /*!< AUXOP (Bit 6)                                         */
 #define R_MIPI_DSI_SQCH1DSC7CR_HL_AUXOP_Msk      (0x40UL)       /*!< AUXOP (Bitfield-Mask: 0x01)                           */
/* ====================================================  SQCH1DSC0CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC0CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC1CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC1CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC2CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC2CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC3CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC3CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC4CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC4CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC5CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC5CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC6CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC6CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ====================================================  SQCH1DSC7CR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7CR_HH_ACTCODE_Pos    (0UL)          /*!< ACTCODE (Bit 0)                                       */
 #define R_MIPI_DSI_SQCH1DSC7CR_HH_ACTCODE_Msk    (0xffUL)       /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC0DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC0DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC1DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC1DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC2DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC2DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC3DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC3DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC4DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC4DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC5DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC5DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC6DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC6DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* ======================================================  SQCH1DSC7DR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC7DR_LADDR_Pos         (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7DR_LADDR_Msk         (0xffffffffUL) /*!< LADDR (Bitfield-Mask: 0xffffffff)                     */
/* =====================================================  SQCH1DSC0DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC1DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC2DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC3DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC4DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC5DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC6DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* =====================================================  SQCH1DSC7DR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7DR_L_LADDR_Pos       (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7DR_L_LADDR_Msk       (0xffffUL)     /*!< LADDR (Bitfield-Mask: 0xffff)                         */
/* ====================================================  SQCH1DSC0DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7DR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7DR_LL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7DR_LL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0DR_LH  ===================================================== */
