MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1AHECBD/mcu.h
 #define R_MIPI_DSI_SQCH1DSC0DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7DR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7DR_LH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7DR_LH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7DR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7DR_HL_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7DR_HL_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7DR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7DR_HH_LADDR_Pos      (0UL)          /*!< LADDR (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7DR_HH_LADDR_Msk      (0xffUL)       /*!< LADDR (Bitfield-Mask: 0xff)                           */

/* =========================================================================================================================== */
/* ================                                      R_OFS_DATAFLASH                                      ================ */
/* =========================================================================================================================== */

/* =======================================================  FSBLCTRL0  ======================================================= */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLEN_Pos        (0UL)     /*!< FSBLEN (Bit 0)                                        */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLEN_Msk        (0x7UL)   /*!< FSBLEN (Bitfield-Mask: 0x07)                          */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPSW_Pos    (3UL)     /*!< FSBLSKIPSW (Bit 3)                                    */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPSW_Msk    (0x38UL)  /*!< FSBLSKIPSW (Bitfield-Mask: 0x07)                      */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPDS_Pos    (6UL)     /*!< FSBLSKIPDS (Bit 6)                                    */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPDS_Msk    (0x1c0UL) /*!< FSBLSKIPDS (Bitfield-Mask: 0x07)                      */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLCLK_Pos       (9UL)     /*!< FSBLCLK (Bit 9)                                       */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLCLK_Msk       (0xe00UL) /*!< FSBLCLK (Bitfield-Mask: 0x07)                         */
/* =======================================================  FSBLCTRL1  ======================================================= */
 #define R_OFS_DATAFLASH_FSBLCTRL1_FSBLEXMD_Pos      (0UL)     /*!< FSBLEXMD (Bit 0)                                      */
 #define R_OFS_DATAFLASH_FSBLCTRL1_FSBLEXMD_Msk      (0x3UL)   /*!< FSBLEXMD (Bitfield-Mask: 0x03)                        */
/* =======================================================  FSBLCTRL2  ======================================================= */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTPN_Pos        (0UL)     /*!< PORTPN (Bit 0)                                        */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTPN_Msk        (0xfUL)   /*!< PORTPN (Bitfield-Mask: 0x0f)                          */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTGN_Pos        (4UL)     /*!< PORTGN (Bit 4)                                        */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTGN_Msk        (0x1f0UL) /*!< PORTGN (Bitfield-Mask: 0x1f)                          */
/* =========================================================  SACC0  ========================================================= */
/* =========================================================  SACC1  ========================================================= */
/* =========================================================  SAMR  ========================================================== */
/* =======================================================  HOEMRTPK  ======================================================== */
/* =========================================================  ARCLS  ========================================================= */
 #define R_OFS_DATAFLASH_ARCLS_ARCS_LK_Pos          (0UL)          /*!< ARCS_LK (Bit 0)                                       */
 #define R_OFS_DATAFLASH_ARCLS_ARCS_LK_Msk          (0x1UL)        /*!< ARCS_LK (Bitfield-Mask: 0x01)                         */
 #define R_OFS_DATAFLASH_ARCLS_ARCNS_LK_Pos         (1UL)          /*!< ARCNS_LK (Bit 1)                                      */
 #define R_OFS_DATAFLASH_ARCLS_ARCNS_LK_Msk         (0x1eUL)       /*!< ARCNS_LK (Bitfield-Mask: 0x0f)                        */
 #define R_OFS_DATAFLASH_ARCLS_ARCBL_LK_Pos         (5UL)          /*!< ARCBL_LK (Bit 5)                                      */
 #define R_OFS_DATAFLASH_ARCLS_ARCBL_LK_Msk         (0x20UL)       /*!< ARCBL_LK (Bitfield-Mask: 0x01)                        */
/* =========================================================  ARCCS  ========================================================= */
 #define R_OFS_DATAFLASH_ARCCS_CNF_ARCNS_Pos        (0UL)          /*!< CNF_ARCNS (Bit 0)                                     */
 #define R_OFS_DATAFLASH_ARCCS_CNF_ARCNS_Msk        (0x3UL)        /*!< CNF_ARCNS (Bitfield-Mask: 0x03)                       */
/* ========================================================  ARC_SEC  ======================================================== */
 #define R_OFS_DATAFLASH_ARC_SEC_ARC_SEC_Pos        (0UL)          /*!< ARC_SEC (Bit 0)                                       */
 #define R_OFS_DATAFLASH_ARC_SEC_ARC_SEC_Msk        (0xffffffffUL) /*!< ARC_SEC (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  ARC_NSEC  ======================================================== */
 #define R_OFS_DATAFLASH_ARC_NSEC_ARC_NSEC_Pos      (0UL)          /*!< ARC_NSEC (Bit 0)                                      */
 #define R_OFS_DATAFLASH_ARC_NSEC_ARC_NSEC_Msk      (0xffffffffUL) /*!< ARC_NSEC (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  ARC_OEMBL  ======================================================= */
 #define R_OFS_DATAFLASH_ARC_OEMBL_ARC_OEMBL_Pos    (0UL)          /*!< ARC_OEMBL (Bit 0)                                     */
 #define R_OFS_DATAFLASH_ARC_OEMBL_ARC_OEMBL_Msk    (0xffffffffUL) /*!< ARC_OEMBL (Bitfield-Mask: 0xffffffff)                 */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA8D1BH_H */

/** @} */ /* End of group R7FA8D1BH */

/** @} */ /* End of group Renesas */
